vegeta-cli/src/vegeta/aeromant/templates/rans_ksst_external_simplefoam/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
  Aeromant template case — values in {{...}} are inserted by aeromant.prepare()
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

simulationType  RAS;

RAS
{
    RASModel        kOmegaSST;
    turbulence      on;
    printCoeffs     on;
}

// ************************************************************************* //
